Конфигурации/DataProcessors/УправлениеГрафикамиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>УправлениеГрафикамиРаботы</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ГрафикРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВремениРаботы</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыВремениРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурации/InformationRegisters/КалендарьГрафиковРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КалендарьГрафиковРаботы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидВремениРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВремениРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРабочихЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурации/DataProcessors/УправлениеГрафикамиРаботы/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ГодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Элементы.Год.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокЛет());
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЛет()
	СписокЛет = Новый Массив;
	Для Год = 2021 По 2121 Цикл
		СписокЛет.Добавить(Год);
		Год = Год + 1;
	КонецЦикла;
	Возврат СписокЛет;
КонецФункции

&НаКлиенте
Процедура ПоказатьГрафикРаботы(Команда)
	Если Исполнитель = ПолучитьПустуюСсылкуСотрудники() Тогда
		Сообщить("Действие не моджет быть выполнено! Не заполнено поле ""Исполнитель"".");
	Иначе
		ПоказатьГрафикРаботыНаСервере();
		Элементы.ГрафикРаботыВидВремениРаботы.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьГрафикРаботыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендарьГрафиковРаботы.Период,
		|	КалендарьГрафиковРаботы.ВидВремениРаботы,
		|	ВЫБОР
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 1
		|			ТОГДА ""Понедельник""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 2
		|			ТОГДА ""Вторник""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 3
		|			ТОГДА ""Среда""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 4
		|			ТОГДА ""Четверг""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 5
		|			ТОГДА ""Пятница""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 6
		|			ТОГДА ""Суббота""
		|		КОГДА ДЕНЬНЕДЕЛИ(КалендарьГрафиковРаботы.Период) = 7
		|			ТОГДА ""Воскресенье""
		|	КОНЕЦ КАК ДеньНедели,
		|	ЛОЖЬ КАК Изменен
		|ИЗ
		|	РегистрСведений.КалендарьГрафиковРаботы КАК КалендарьГрафиковРаботы
		|ГДЕ
		|	КалендарьГрафиковРаботы.Исполнитель = &Исполнитель
		|	И КалендарьГрафиковРаботы.Год = &Год";
	
	Запрос.УстановитьПараметр("Исполнитель", Исполнитель);
	Запрос.УстановитьПараметр("Год", Год);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("По выбранному исполнителю за указанный год не найдено записей.");		
	Иначе
		Объект.ГрафикРаботы.Загрузить(РезультатЗапроса.Выгрузить());
		Элементы.ИзменитьГрафикРаботы.Доступность = Истина;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуюСсылкуСотрудники()
	Возврат Справочники.Сотрудники.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ИзменитьГрафикРаботы(Команда)
	Элементы.ГрафикРаботыВидВремениРаботы.Доступность = Истина;
	Элементы.ГрафикРаботыВидВремениРаботы.ЦветФона = Новый Цвет(152,251,152); 
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыВидВремениРаботыПриИзменении(Элемент)
	Элементы.СохранитьИменения.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИменения(Команда)
	СохранитьИмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьИмененияНаСервере()
	
	Для Каждого Запись Из Объект.ГрафикРаботы Цикл	
		МенеджерЗаписи = РегистрыСведений.КалендарьГрафиковРаботы.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Период = Запись.Период;
		МенеджерЗаписи.Год = Год;
		МенеджерЗаписи.Исполнитель = Исполнитель;
		МенеджерЗаписи.ВидВремениРаботы = Запись.ВидВремениРаботы;
		МенеджерЗаписи.КоличествоРабочихЧасов = 8;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	Сообщить("Изменения сохранены!");
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	Элементы.ИзменитьГрафикРаботы.Доступность = Ложь;
	Элементы.СохранитьИменения.Доступность = Ложь;
	Объект.ГрафикРаботы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Элементы.ИзменитьГрафикРаботы.Доступность = Ложь;
	Элементы.СохранитьИменения.Доступность = Ложь;
	Объект.ГрафикРаботы.Очистить();
КонецПроцедуры
